/*
Navicat MySQL Data Transfer

Source Server         : Hong
Source Server Version : 50538
Source Host           : localhost:3308
Source Database       : db_boss

Target Server Type    : MYSQL
Target Server Version : 50538
File Encoding         : 65001

Date: 2014-12-08 16:01:11
*/

SET FOREIGN_KEY_CHECKS=0;

-- ----------------------------
-- Table structure for `tb_goods`
-- ----------------------------
DROP TABLE IF EXISTS `tb_goods`;
CREATE TABLE `tb_goods` (
  `id` int(11) NOT NULL AUTO_INCREMENT COMMENT 'ID',
  `barcode` varchar(255) NOT NULL COMMENT '条形码',
  `product` varchar(255) DEFAULT NULL COMMENT '商品名',
  `letter` varchar(255) DEFAULT NULL COMMENT '大写首字母',
  `type` varchar(255) DEFAULT NULL COMMENT '商品类型',
  `standard` varchar(255) DEFAULT NULL COMMENT '规格',
  `unit` varchar(10) DEFAULT NULL COMMENT '计量单位',
  `price` decimal(18,2) DEFAULT NULL COMMENT '建议售价',
  `info` text COMMENT '商品描述',
  PRIMARY KEY (`id`,`barcode`)
) ENGINE=InnoDB AUTO_INCREMENT=20 DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of tb_goods
-- ----------------------------
INSERT INTO `tb_goods` VALUES ('4', '66464546454646', '依依', 'YY', '清纯服装', '大码', '件', '130.00', '超级版清纯版女装。超级版清纯版女装。超级版清纯版女装。超级版清纯版女装。\r\n	超级版清纯版女装。超级版清纯版女装。超级版清纯版女装。超级版清纯版女装。\r\n	超级版清纯版女装。超级版清纯版女装。超级版清纯版女装。超级版清纯版女装。\r\n	超级版清纯版女装。超级版清纯版女装。超级版清纯版女装。超级版清纯版女装\r\n	。超级版清纯版女装。');
INSERT INTO `tb_goods` VALUES ('5', '123', '华为P6', 'HW', '电子设备', '超薄型手机', '台', '2600.00', '<p style=\"text-align:center;\">\r\n	华为P6，电信版，2000元，值得拥有，可是用了没多久，进水坏了。\r\n</p>\r\n<p style=\"text-align:center;\">\r\n	华为P6，电信版，2000元，值得拥有，可是用了没多久，进水坏了。\r\n</p>\r\n<p style=\"text-align:center;\">\r\n	华为P6，电信版，2000元，值得拥有，可是用了没多久，进水坏了。\r\n</p>\r\n<p style=\"text-align:center;\">\r\n	华为P6，电信版，2000元，值得拥有，可是用了没多久，进水坏了。\r\n</p>\r\n<p style=\"text-align:center;\">\r\n	华为P6，电信版，2000元，值得拥有，可是用了没多久，进水坏了。\r\n</p>\r\n<p style=\"text-align:center;\">\r\n	华为P6，电信版，2000元，值得拥有，可是用了没多久，进水坏了。\r\n</p>\r\n<p style=\"text-align:center;\">\r\n	华为P6，电信版，2000元，值得拥有，可是用了没多久，进水坏了。\r\n</p>');
INSERT INTO `tb_goods` VALUES ('7', '3333', '三星手机', 'SXSJ', '电子设备', '超霸气手机', '台', '3200.00', '大气的手机<span>大气的手机</span><span>大气的手机</span>');
INSERT INTO `tb_goods` VALUES ('13', '6921294389463', '玉林牛巴', 'YLNB', null, '有色甜品', '瓶', '18.00', '333');
INSERT INTO `tb_goods` VALUES ('17', '6901285991219', '怡宝引用纯净水', 'YBYYCJS', '6666', '455', '瓶', '19.00', '');
INSERT INTO `tb_goods` VALUES ('18', '62179330088', 'BB大宝', 'BBDB', '1111', '464566', '瓶', '10.00', 'BAOBAO');
INSERT INTO `tb_goods` VALUES ('19', '6921734973023', '7302液体胶', '7302YTJ', '娱乐', '发发发', '瓶', '3.00', '得力集团');

-- ----------------------------
-- Table structure for `tb_sales`
-- ----------------------------
DROP TABLE IF EXISTS `tb_sales`;
CREATE TABLE `tb_sales` (
  `id` int(11) NOT NULL AUTO_INCREMENT COMMENT 'ID',
  `out_id` int(11) DEFAULT NULL COMMENT 'tb_out 哪条数据的ID',
  `barcode` varchar(255) NOT NULL COMMENT '商品条形码',
  `product` varchar(255) DEFAULT NULL COMMENT '商品名称',
  `letter` varchar(255) DEFAULT NULL COMMENT '首字母大写',
  `num` int(11) DEFAULT '0' COMMENT '数量',
  `presell` decimal(18,2) DEFAULT '0.00' COMMENT '预售价',
  `amount` decimal(18,2) DEFAULT '0.00' COMMENT '交易金额',
  `salesman` varchar(20) DEFAULT 'No One' COMMENT '销售员',
  `saledate` varchar(20) DEFAULT NULL COMMENT '售出日期',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=338 DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of tb_sales
-- ----------------------------
INSERT INTO `tb_sales` VALUES ('1', '11', '123', '华为P6', 'HW', '1', '20.00', '20.00', 'CLC', '2014-10-23 10:10:20');
INSERT INTO `tb_sales` VALUES ('2', '11', '123', '华为P6', 'HW', '1', '10.00', '10.00', '小信', '2014-10-23 10:11:20');
INSERT INTO `tb_sales` VALUES ('3', '11', '123', '华为P6', 'HW', '1', '10.00', '10.00', '小信', '2014-10-23 10:12:20');
INSERT INTO `tb_sales` VALUES ('4', '11', '123', '华为P6', 'HW', '1', '10.00', '10.00', '小信', '2014-10-23 10:13:20');
INSERT INTO `tb_sales` VALUES ('5', '11', '123', '华为P6', 'HW', '1', '10.00', '10.00', '小信', '2014-10-23 10:14:20');
INSERT INTO `tb_sales` VALUES ('6', '11', '123', '华为P6', 'HW', '1', '10.00', '10.00', '小信', '2014-10-23 10:15:20');
INSERT INTO `tb_sales` VALUES ('7', '11', '123', '华为P6', 'HW', '1', '10.00', '10.00', '小信', '2014-10-23 10:16:20');
INSERT INTO `tb_sales` VALUES ('8', '11', '123', '华为P6', 'HW', '1', '10.00', '10.00', '小信', '2014-10-23 10:17:20');
INSERT INTO `tb_sales` VALUES ('9', '11', '123', '华为P6', 'HW', '1', '10.00', '10.00', '小信', '2014-10-23 10:18:20');
INSERT INTO `tb_sales` VALUES ('10', '11', '123', '华为P6', 'HW', '1', '10.00', '10.00', '小信', '2014-10-23 10:19:20');
INSERT INTO `tb_sales` VALUES ('11', '11', '123', '华为P6', 'HW', '1', '10.00', '10.00', '火狐', '2014-10-23 10:20:20');
INSERT INTO `tb_sales` VALUES ('12', '11', '123', '华为P6', 'HW', '1', '10.00', '10.00', '火狐', '2014-10-23 10:30:20');
INSERT INTO `tb_sales` VALUES ('13', '11', '123', '华为P6', 'HW', '1', '10.00', '10.00', '火狐', '2014-10-23 14:12:42');
INSERT INTO `tb_sales` VALUES ('14', '11', '123', '华为P6', 'HW', '1', '10.00', '10.00', '火狐', '2014-10-23 14:13:01');
INSERT INTO `tb_sales` VALUES ('15', '11', '123', '华为P6', 'HW', '2', '13.00', '26.00', 'XC', '2014-10-24 10:20:40');
INSERT INTO `tb_sales` VALUES ('16', '11', '123', '华为P6', 'HW', '2', '13.00', '26.00', 'XC', '2014-10-24 10:23:23');
INSERT INTO `tb_sales` VALUES ('17', '11', '123', '华为P6', 'HW', '2', '13.00', '26.00', 'XC', '2014-10-24 10:23:43');
INSERT INTO `tb_sales` VALUES ('18', '8', '6921294389463', '玉林牛巴', null, null, null, '0.00', null, '2014-10-24 14:00:12');
INSERT INTO `tb_sales` VALUES ('19', '8', '6921294389463', '玉林牛巴', null, '1', '2.80', '2.80', 'XC', '2014-10-24 14:11:17');
INSERT INTO `tb_sales` VALUES ('20', '11', '123', '华为P6', 'HW', '1', '10.00', '10.00', '', '2014-10-27 08:55:53');
INSERT INTO `tb_sales` VALUES ('21', '11', '33', '33', '', null, null, '0.00', null, '2014-10-27 08:56:54');
INSERT INTO `tb_sales` VALUES ('22', '11', '123', '华为P6', 'HW', '1', '10.00', '10.00', '45646', '2014-10-27 09:32:42');
INSERT INTO `tb_sales` VALUES ('23', null, '3', '3', null, null, null, '0.00', null, '2014-10-27 09:33:39');
INSERT INTO `tb_sales` VALUES ('24', '11', '123', '华为P6', 'HW', null, null, '0.00', '222', '2014-10-27 09:37:09');
INSERT INTO `tb_sales` VALUES ('25', null, '8888', '888', null, null, null, '0.00', null, '2014-10-27 09:38:07');
INSERT INTO `tb_sales` VALUES ('26', null, '9989898', '8899999', null, null, null, '0.00', '222', '2014-10-27 09:38:56');
INSERT INTO `tb_sales` VALUES ('27', null, '000', '000', null, null, null, '0.00', null, '2014-10-27 09:43:02');
INSERT INTO `tb_sales` VALUES ('28', null, '333', '333', null, null, null, '0.00', '333', '2014-10-27 11:43:50');
INSERT INTO `tb_sales` VALUES ('29', '11', '123', '华为P6', 'HW', '1', '10.00', '10.00', '', '2014-10-27 11:53:56');
INSERT INTO `tb_sales` VALUES ('31', '11', '123', '华为P6', 'HW', null, null, '0.00', null, '2014-10-27 13:33:15');
INSERT INTO `tb_sales` VALUES ('32', '11', '123', '华为P6', 'HW', '1', '10.00', '10.00', '444', '2014-10-27 13:45:26');
INSERT INTO `tb_sales` VALUES ('34', null, '78978', '78978', null, null, null, '0.00', null, '2014-10-27 13:47:05');
INSERT INTO `tb_sales` VALUES ('35', null, '122', '122', null, null, null, '0.00', null, '2014-10-27 13:54:17');
INSERT INTO `tb_sales` VALUES ('37', '11', '123', '华为P6', 'HW', '1', '10.00', '10.00', '555', '2014-10-27 13:58:58');
INSERT INTO `tb_sales` VALUES ('38', '11', '123', '华为P6', 'HW', '1', '10.00', '10.00', '', '2014-10-27 13:58:58');
INSERT INTO `tb_sales` VALUES ('39', '11', '123', '华为P6', 'HW', '1', '10.00', '10.00', '555', '2014-10-27 13:59:26');
INSERT INTO `tb_sales` VALUES ('40', '11', '123', '华为P6', 'HW', '1', '10.00', '10.00', '444', '2014-10-27 14:03:31');
INSERT INTO `tb_sales` VALUES ('51', '11', '123', '华为P6', null, '1', '10.00', '10.00', '', '2014-10-27 14:40:15');
INSERT INTO `tb_sales` VALUES ('52', '11', '123', '华为P6', null, '1', '10.00', '10.00', '', '2014-10-27 15:10:34');
INSERT INTO `tb_sales` VALUES ('53', '11', '123', '华为P6', null, '1', '10.00', '10.00', '111', '2014-10-27 15:26:08');
INSERT INTO `tb_sales` VALUES ('54', '11', '123', '华为P6', null, '1', '10.00', '10.00', '555', '2014-10-27 15:28:39');
INSERT INTO `tb_sales` VALUES ('55', '11', '123', '华为P6', null, '1', '10.00', '10.00', '', '2014-10-27 15:31:50');
INSERT INTO `tb_sales` VALUES ('56', '11', '123', '华为P6', null, '1', '10.00', '10.00', '', '2014-10-27 15:32:18');
INSERT INTO `tb_sales` VALUES ('57', '11', '123', '华为P6', null, '1', '10.00', '10.00', '222', '2014-10-27 15:32:51');
INSERT INTO `tb_sales` VALUES ('58', '11', '123', '华为P6', null, '1', '10.00', '10.00', '', '2014-10-27 15:33:18');
INSERT INTO `tb_sales` VALUES ('59', '11', '123', '华为P6', null, '1', '10.00', '10.00', '333', '2014-10-27 15:34:08');
INSERT INTO `tb_sales` VALUES ('60', '11', '123', '华为P6', null, '1', '10.00', '10.00', '', '2014-10-27 15:39:03');
INSERT INTO `tb_sales` VALUES ('61', '11', '123', '华为P6', null, '1', '10.00', '10.00', '111', '2014-10-27 15:42:04');
INSERT INTO `tb_sales` VALUES ('62', '11', '123', '华为P6', null, '1', '10.00', '10.00', '', '2014-10-27 15:56:22');
INSERT INTO `tb_sales` VALUES ('63', '11', '123', '华为P6', null, '1', '10.00', '10.00', '222', '2014-10-28 09:55:13');
INSERT INTO `tb_sales` VALUES ('64', '11', '123', null, null, '1', '10.00', '10.00', '', '2014-10-28 09:58:35');
INSERT INTO `tb_sales` VALUES ('65', null, '11', null, null, null, null, '0.00', '333', '2014-10-28 09:58:56');
INSERT INTO `tb_sales` VALUES ('66', '11', '123', null, null, '1', '10.00', '10.00', '', '2014-10-28 09:59:45');
INSERT INTO `tb_sales` VALUES ('67', '11', '123', null, null, '1', '10.00', '10.00', '', '2014-10-28 10:03:53');
INSERT INTO `tb_sales` VALUES ('68', '11', '123', null, null, '1', '10.00', '10.00', '', '2014-10-28 10:13:58');
INSERT INTO `tb_sales` VALUES ('69', '11', '123', null, null, '1', '10.00', '10.00', '333', '2014-10-28 10:14:44');
INSERT INTO `tb_sales` VALUES ('70', '11', '123', null, null, '1', '10.00', '10.00', '333', '2014-10-28 10:17:42');
INSERT INTO `tb_sales` VALUES ('71', '8', '6921294389463', null, null, '1', '2.80', '2.80', '', '2014-10-28 10:48:00');
INSERT INTO `tb_sales` VALUES ('72', null, 'hw', null, null, null, null, '0.00', '333', '2014-10-28 13:50:22');
INSERT INTO `tb_sales` VALUES ('73', '11', '123', null, null, '2', '10.00', '20.00', '', '2014-10-28 16:02:30');
INSERT INTO `tb_sales` VALUES ('74', '14', '123', null, null, '3', '10.00', '30.00', '333', '2014-10-28 16:03:17');
INSERT INTO `tb_sales` VALUES ('75', '14', '123', null, null, '1', '10.00', '10.00', '', '2014-10-28 16:06:07');
INSERT INTO `tb_sales` VALUES ('76', '14', '123', null, null, '1', '10.00', '10.00', '333', '2014-10-28 16:22:30');
INSERT INTO `tb_sales` VALUES ('77', '14', '123', null, null, '1', '10.00', '10.00', '', '2014-10-28 16:24:26');
INSERT INTO `tb_sales` VALUES ('78', '14', '123', null, null, '1', '10.00', '10.00', '', '2014-10-28 16:27:12');
INSERT INTO `tb_sales` VALUES ('79', '14', '123', null, null, '1', '10.00', '10.00', '333', '2014-10-28 16:27:24');
INSERT INTO `tb_sales` VALUES ('80', '14', '123', '华为P6', null, '1', '10.00', '10.00', '', '2014-10-28 16:45:01');
INSERT INTO `tb_sales` VALUES ('81', '14', '123', '华为P6', null, '1', '10.00', '10.00', '', '2014-10-28 17:08:30');
INSERT INTO `tb_sales` VALUES ('82', '14', '123', '华为P6', null, '1', '10.00', '10.00', '333', '2014-10-28 17:10:34');
INSERT INTO `tb_sales` VALUES ('83', '14', '123', '华为P6', null, '1', '10.00', '10.00', '', '2014-10-28 17:12:50');
INSERT INTO `tb_sales` VALUES ('84', '14', '123', '华为P6', null, '1', '10.00', '10.00', '333', '2014-10-28 17:13:03');
INSERT INTO `tb_sales` VALUES ('85', '14', '123', '华为P6', null, '1', '10.00', '10.00', '', '2014-10-28 17:15:18');
INSERT INTO `tb_sales` VALUES ('86', '14', '123', '华为P6', null, '1', '10.00', '10.00', '', '2014-10-28 17:17:04');
INSERT INTO `tb_sales` VALUES ('87', '14', '123', '华为P6', null, '1', '10.00', '10.00', '333', '2014-10-28 17:33:43');
INSERT INTO `tb_sales` VALUES ('88', '14', '123', '华为P6', null, '1', '10.00', '10.00', '', '2014-10-28 17:34:18');
INSERT INTO `tb_sales` VALUES ('89', '14', '123', '华为P6', null, '1', '10.00', '10.00', '', '2014-10-28 17:34:43');
INSERT INTO `tb_sales` VALUES ('90', '14', '123', '华为P6', null, '1', '10.00', '10.00', '333', '2014-10-28 17:35:02');
INSERT INTO `tb_sales` VALUES ('91', '14', '123', '华为P6', null, '1', '10.00', '10.00', '', '2014-10-28 17:35:52');
INSERT INTO `tb_sales` VALUES ('92', '14', '123', '华为P6', null, '1', '10.00', '10.00', '333', '2014-10-28 17:36:33');
INSERT INTO `tb_sales` VALUES ('93', '14', '123', '华为P6', null, '1', '10.00', '10.00', '', '2014-10-28 17:37:03');
INSERT INTO `tb_sales` VALUES ('94', '14', '123', '华为P6', null, '1', '10.00', '10.00', '', '2014-10-28 17:37:22');
INSERT INTO `tb_sales` VALUES ('95', '14', '123', '华为P6', null, '1', '10.00', '10.00', '333', '2014-10-28 17:37:47');
INSERT INTO `tb_sales` VALUES ('96', '14', '123', '华为P6', null, '1', '10.00', '10.00', '', '2014-10-28 17:38:31');
INSERT INTO `tb_sales` VALUES ('97', '14', '123', '华为P6', null, '1', '10.00', '10.00', '333', '2014-10-28 17:38:49');
INSERT INTO `tb_sales` VALUES ('98', '14', '123', '华为P6', null, '1', '10.00', '10.00', '', '2014-10-28 17:40:43');
INSERT INTO `tb_sales` VALUES ('99', '14', '123', '华为P6', null, '1', '10.00', '10.00', '333', '2014-10-28 17:40:54');
INSERT INTO `tb_sales` VALUES ('100', '14', '123', '华为P6', null, '1', '10.00', '10.00', '', '2014-10-28 17:42:47');
INSERT INTO `tb_sales` VALUES ('101', '14', '123', '华为P6', null, '1', '10.00', '10.00', '333', '2014-10-28 17:43:55');
INSERT INTO `tb_sales` VALUES ('102', '14', '123', '华为P6', null, '1', '10.00', '10.00', '', '2014-10-28 17:44:22');
INSERT INTO `tb_sales` VALUES ('103', '14', '123', '华为P6', null, '1', '10.00', '10.00', '', '2014-10-28 17:44:53');
INSERT INTO `tb_sales` VALUES ('104', '14', '123', '华为P6', null, '1', '10.00', '10.00', '333', '2014-10-28 17:55:19');
INSERT INTO `tb_sales` VALUES ('105', '14', '123', '华为P6', null, '1', '10.00', '10.00', '', '2014-10-29 08:42:47');
INSERT INTO `tb_sales` VALUES ('106', '14', '123', '华为P6', null, '1', '10.00', '10.00', '', '2014-10-29 08:44:36');
INSERT INTO `tb_sales` VALUES ('107', '14', '123', '华为P6', null, '1', '10.00', '10.00', '333', '2014-10-29 08:56:44');
INSERT INTO `tb_sales` VALUES ('108', '14', '123', '华为P6', null, '1', '10.00', '10.00', '', '2014-10-29 09:00:10');
INSERT INTO `tb_sales` VALUES ('109', '14', '123', '华为P6', null, '1', '10.00', '10.00', '', '2014-10-29 09:01:38');
INSERT INTO `tb_sales` VALUES ('110', '14', '123', '华为P6', null, '1', '10.00', '10.00', '', '2014-10-29 09:04:16');
INSERT INTO `tb_sales` VALUES ('111', '14', '123', '华为P6', null, '1', '10.00', '10.00', '333', '2014-10-29 09:05:17');
INSERT INTO `tb_sales` VALUES ('112', '14', '123', '华为P6', null, '1', '10.00', '10.00', '', '2014-10-29 09:05:30');
INSERT INTO `tb_sales` VALUES ('113', '14', '123', '华为P6', null, '1', '10.00', '10.00', '', '2014-10-29 09:06:07');
INSERT INTO `tb_sales` VALUES ('114', '14', '123', '华为P6', null, '1', '10.00', '10.00', '555', '2014-10-29 09:06:29');
INSERT INTO `tb_sales` VALUES ('115', '14', '123', '华为P6', null, '1', '10.00', '10.00', '', '2014-10-29 09:06:57');
INSERT INTO `tb_sales` VALUES ('116', '14', '123', '华为P6', null, '1', '10.00', '10.00', '444', '2014-10-29 09:07:32');
INSERT INTO `tb_sales` VALUES ('117', '14', '123', '华为P6', null, '1', '10.00', '10.00', '', '2014-10-29 09:08:05');
INSERT INTO `tb_sales` VALUES ('118', '14', '123', '华为P6', null, '1', '10.00', '10.00', '', '2014-10-29 09:08:41');
INSERT INTO `tb_sales` VALUES ('119', '14', '123', '华为P6', null, '1', '10.00', '10.00', '', '2014-10-29 09:10:24');
INSERT INTO `tb_sales` VALUES ('120', '14', '123', '华为P6', null, '1', '10.00', '10.00', '555', '2014-10-29 09:10:49');
INSERT INTO `tb_sales` VALUES ('121', '14', '123', '华为P6', null, '1', '10.00', '10.00', '', '2014-10-29 09:11:06');
INSERT INTO `tb_sales` VALUES ('122', '14', '123', '华为P6', null, '1', '10.00', '10.00', '444', '2014-10-29 09:11:40');
INSERT INTO `tb_sales` VALUES ('123', '14', '123', '华为P6', null, '1', '10.00', '10.00', '', '2014-10-29 09:12:04');
INSERT INTO `tb_sales` VALUES ('124', '14', '123', '华为P6', null, '1', '10.00', '10.00', '333', '2014-10-29 09:12:28');
INSERT INTO `tb_sales` VALUES ('125', '14', '123', '华为P6', null, '1', '10.00', '10.00', '', '2014-10-29 09:12:58');
INSERT INTO `tb_sales` VALUES ('126', '14', '123', '华为P6', null, '1', '10.00', '10.00', '444', '2014-10-29 09:13:36');
INSERT INTO `tb_sales` VALUES ('127', '14', '123', '华为P6', null, '1', '10.00', '10.00', '555', '2014-10-29 09:14:23');
INSERT INTO `tb_sales` VALUES ('128', '14', '123', '华为P6', null, '1', '10.00', '10.00', '444', '2014-10-29 09:14:46');
INSERT INTO `tb_sales` VALUES ('129', '14', '123', '华为P6', null, '1', '10.00', '10.00', '', '2014-10-29 09:15:22');
INSERT INTO `tb_sales` VALUES ('130', '14', '123', '华为P6', null, '1', '10.00', '10.00', '555', '2014-10-29 09:16:01');
INSERT INTO `tb_sales` VALUES ('131', '14', '123', '华为P6', null, '1', '10.00', '10.00', '', '2014-10-29 09:16:45');
INSERT INTO `tb_sales` VALUES ('132', '14', '123', '华为P6', null, '1', '10.00', '10.00', '555', '2014-10-29 09:16:59');
INSERT INTO `tb_sales` VALUES ('133', '14', '123', '华为P6', null, '1', '10.00', '10.00', '444', '2014-10-29 09:17:16');
INSERT INTO `tb_sales` VALUES ('134', '14', '123', '华为P6', null, '1', '10.00', '10.00', '555', '2014-10-29 09:17:33');
INSERT INTO `tb_sales` VALUES ('135', '14', '123', '华为P6', null, '1', '10.00', '10.00', '', '2014-10-29 09:17:52');
INSERT INTO `tb_sales` VALUES ('136', '14', '123', '华为P6', null, '1', '10.00', '10.00', '', '2014-10-29 09:18:01');
INSERT INTO `tb_sales` VALUES ('137', '14', '123', '华为P6', null, '1', '10.00', '10.00', '', '2014-10-29 09:18:17');
INSERT INTO `tb_sales` VALUES ('138', '14', '123', '华为P6', null, '1', '10.00', '10.00', '', '2014-10-29 09:18:39');
INSERT INTO `tb_sales` VALUES ('139', '14', '123', '华为P6', null, '1', '10.00', '10.00', '', '2014-10-29 11:56:27');
INSERT INTO `tb_sales` VALUES ('140', '14', '123', '华为P6', null, '1', '10.00', '10.00', '', '2014-10-29 11:57:30');
INSERT INTO `tb_sales` VALUES ('141', '14', '123', '华为P6', null, '1', '10.00', '10.00', '', '2014-10-29 11:57:33');
INSERT INTO `tb_sales` VALUES ('142', '14', '123', '华为P6', null, '1', '10.00', '10.00', 'xc', '2014-10-29 11:58:35');
INSERT INTO `tb_sales` VALUES ('143', '14', '123', '华为P6', null, '1', '10.00', '10.00', 'xc', '2014-10-29 12:03:29');
INSERT INTO `tb_sales` VALUES ('144', '14', '123', '华为P6', null, '1', '10.00', '10.00', '', '2014-10-29 12:26:11');
INSERT INTO `tb_sales` VALUES ('145', '14', '123', '华为P6', null, '1', '10.00', '10.00', '', '2014-10-29 12:27:30');
INSERT INTO `tb_sales` VALUES ('146', '14', '123', '华为P6', null, '1', '10.00', '10.00', '', '2014-10-29 12:28:42');
INSERT INTO `tb_sales` VALUES ('147', '14', '123', '华为P6', null, '1', '10.00', '10.00', '', '2014-10-29 12:28:54');
INSERT INTO `tb_sales` VALUES ('148', '14', '123', '华为P6', null, '1', '10.00', '10.00', '', '2014-10-29 12:29:07');
INSERT INTO `tb_sales` VALUES ('149', '14', '123', '华为P6', null, '1', '10.00', '10.00', 'XC', '2014-10-29 12:29:21');
INSERT INTO `tb_sales` VALUES ('150', '14', '123', '华为P6', null, '1', '10.00', '10.00', 'XC', '2014-10-29 12:29:30');
INSERT INTO `tb_sales` VALUES ('151', '14', '123', '华为P6', null, '1', '10.00', '10.00', '', '2014-10-29 12:29:38');
INSERT INTO `tb_sales` VALUES ('152', '14', '123', '华为P6', null, '1', '10.00', '10.00', '荔香楼', '2014-10-29 12:32:34');
INSERT INTO `tb_sales` VALUES ('153', '14', '123', '华为P6', null, '1', '10.00', '10.00', '李向芳', '2014-10-29 12:34:06');
INSERT INTO `tb_sales` VALUES ('154', '14', '123', '华为P6', null, '1', '10.00', '10.00', '李晓芳', '2014-10-29 12:34:56');
INSERT INTO `tb_sales` VALUES ('155', '14', '123', '华为P6', null, '1', '10.00', '10.00', '111', '2014-10-30 11:28:31');
INSERT INTO `tb_sales` VALUES ('156', '14', '123', '华为P6', null, '1', '10.00', '10.00', '111', '2014-10-30 11:28:58');
INSERT INTO `tb_sales` VALUES ('157', '14', '123', '华为P6', null, '1', '10.00', '10.00', '111', '2014-10-30 11:44:28');
INSERT INTO `tb_sales` VALUES ('158', '14', '123', '华为P6', null, '1', '10.00', '10.00', '111', '2014-10-30 13:46:29');
INSERT INTO `tb_sales` VALUES ('159', '14', '123', '华为P6', null, '1', '10.00', '10.00', '111', '2014-10-30 13:46:31');
INSERT INTO `tb_sales` VALUES ('160', '14', '123', '华为P6', null, '1', '10.00', '10.00', '111', '2014-10-30 13:46:32');
INSERT INTO `tb_sales` VALUES ('161', '14', '123', '华为P6', null, '1', '10.00', '10.00', '111', '2014-10-30 13:46:33');
INSERT INTO `tb_sales` VALUES ('162', '14', '123', '华为P6', null, '1', '10.00', '10.00', '111', '2014-10-30 13:46:33');
INSERT INTO `tb_sales` VALUES ('163', '14', '123', '华为P6', null, '1', '10.00', '10.00', '111', '2014-10-30 13:46:33');
INSERT INTO `tb_sales` VALUES ('164', '14', '123', '华为P6', null, '1', '10.00', '10.00', '111', '2014-10-30 13:46:34');
INSERT INTO `tb_sales` VALUES ('165', '14', '123', '华为P6', null, '1', '10.00', '10.00', '111', '2014-10-30 13:52:48');
INSERT INTO `tb_sales` VALUES ('166', '14', '123', '华为P6', null, '1', '10.00', '10.00', '111', '2014-10-30 13:52:51');
INSERT INTO `tb_sales` VALUES ('167', '14', '123', '华为P6', null, '1', '10.00', '10.00', '111', '2014-10-30 13:53:50');
INSERT INTO `tb_sales` VALUES ('168', '14', '123', '华为P6', null, '1', '10.00', '10.00', '111', '2014-10-30 14:04:31');
INSERT INTO `tb_sales` VALUES ('169', '14', '123', '华为P6', null, '1', '10.00', '10.00', '111', '2014-10-30 14:04:51');
INSERT INTO `tb_sales` VALUES ('170', '14', '123', '华为P6', null, '1', '10.00', '10.00', '111', '2014-10-30 14:07:40');
INSERT INTO `tb_sales` VALUES ('171', '14', '123', '华为P6', null, '1', '10.00', '10.00', '111', '2014-10-30 14:14:48');
INSERT INTO `tb_sales` VALUES ('172', '14', '123', '华为P6', null, '1', '10.00', '10.00', '111', '2014-10-30 14:14:56');
INSERT INTO `tb_sales` VALUES ('173', '14', '123', '华为P6', null, '1', '10.00', '10.00', '111', '2014-10-30 14:17:33');
INSERT INTO `tb_sales` VALUES ('174', '14', '123', '华为P6', null, '1', '10.00', '10.00', '111', '2014-10-30 14:18:22');
INSERT INTO `tb_sales` VALUES ('175', '14', '123', '华为P6', null, '1', '10.00', '10.00', '111', '2014-10-30 14:18:47');
INSERT INTO `tb_sales` VALUES ('176', '14', '123', '华为P6', null, '1', '10.00', '10.00', '111', '2014-10-30 14:20:22');
INSERT INTO `tb_sales` VALUES ('177', '14', '123', '华为P6', null, '1', '10.00', '10.00', '111', '2014-10-30 14:20:24');
INSERT INTO `tb_sales` VALUES ('178', '14', '123', '华为P6', null, '1', '10.00', '10.00', '111', '2014-10-30 14:24:07');
INSERT INTO `tb_sales` VALUES ('179', '14', '123', '华为P6', null, '1', '10.00', '10.00', '111', '2014-10-30 14:24:53');
INSERT INTO `tb_sales` VALUES ('180', '14', '123', '华为P6', null, '1', '10.00', '10.00', '111', '2014-10-30 14:28:22');
INSERT INTO `tb_sales` VALUES ('181', '14', '123', '华为P6', null, '1', '10.00', '10.00', '111', '2014-10-30 14:35:06');
INSERT INTO `tb_sales` VALUES ('182', '14', '123', '华为P6', null, '1', '10.00', '10.00', '111', '2014-10-30 15:00:03');
INSERT INTO `tb_sales` VALUES ('183', '14', '123', '华为P6', null, '1', '10.00', '10.00', '111', '2014-10-30 15:05:14');
INSERT INTO `tb_sales` VALUES ('184', '14', '123', '华为P6', null, '1', '10.00', '10.00', '111', '2014-10-30 15:08:52');
INSERT INTO `tb_sales` VALUES ('185', '14', '123', '华为P6', null, '1', '10.00', '10.00', '111', '2014-10-30 15:10:32');
INSERT INTO `tb_sales` VALUES ('186', '14', '123', '华为P6', null, '1', '10.00', '10.00', '111', '2014-10-30 15:58:18');
INSERT INTO `tb_sales` VALUES ('187', '14', '123', '华为P6', null, '1', '10.00', '10.00', '111', '2014-10-30 15:58:19');
INSERT INTO `tb_sales` VALUES ('188', '14', '123', '华为P6', 'HW', '1', '10.00', '10.00', '111', '2014-10-30 15:58:19');
INSERT INTO `tb_sales` VALUES ('189', '14', '123', '华为P6', 'HW', '1', '10.00', '10.00', '', '2014-10-30 16:15:24');
INSERT INTO `tb_sales` VALUES ('190', '14', '123', '华为P6', 'HW', '1', '10.00', '10.00', '111', '2014-10-31 15:33:27');
INSERT INTO `tb_sales` VALUES ('191', '21', '123', '华为P6', 'HW', '1', '10.00', '10.00', '555', '2014-11-10 17:28:19');
INSERT INTO `tb_sales` VALUES ('192', '21', '123', '华为P6', 'HW', '3', '10.00', '30.00', 'boss', '2014-11-07 11:53:19');
INSERT INTO `tb_sales` VALUES ('193', '21', '123', '华为P6', 'HW', '2', '10.00', '20.00', 'boss', '2014-11-07 11:59:11');
INSERT INTO `tb_sales` VALUES ('194', '21', '123', '华为P6', 'HW', '1', '10.00', '10.00', 'boss', '2014-11-07 12:03:34');
INSERT INTO `tb_sales` VALUES ('195', '21', '123', '华为P6', 'HW', '1', '10.00', '10.00', 'boss', '2014-11-07 13:38:24');
INSERT INTO `tb_sales` VALUES ('196', null, '123', '华为P6', 'HW', '2', '10.00', '20.00', '555', '2014-11-10 13:52:29');
INSERT INTO `tb_sales` VALUES ('197', '11', '123', '华为P6', 'HW', '1', '10.00', '10.00', '555', '2014-11-10 14:25:28');
INSERT INTO `tb_sales` VALUES ('198', '11', '123', '华为P6', 'HW', '1', '10.00', '10.00', '555', '2014-11-10 14:26:48');
INSERT INTO `tb_sales` VALUES ('199', '11', '123', '华为P6', 'HW', '1', '10.00', '10.00', '555', '2014-11-10 14:27:10');
INSERT INTO `tb_sales` VALUES ('200', '11', '123', '华为P6', 'HW', '1', '10.00', '10.00', '555', '2014-11-10 08:41:48');
INSERT INTO `tb_sales` VALUES ('201', '8', '6921294389463', '玉林牛巴', 'YLNB', '20', '28.00', '560.00', '555', '2014-11-10 09:51:57');
INSERT INTO `tb_sales` VALUES ('202', '11', '123', '华为P6', 'HW', '1', '10.00', '10.00', '555', '2014-11-10 16:26:18');
INSERT INTO `tb_sales` VALUES ('203', '11', '123', '华为P6', 'HW', '1', '10.00', '10.00', '555', '2014-11-10 16:26:35');
INSERT INTO `tb_sales` VALUES ('204', '11', '123', '华为P6', 'HW', '2', '10.00', '20.00', '555', '2014-11-10 16:26:49');
INSERT INTO `tb_sales` VALUES ('205', '11', '123', '华为P6', null, '1', '10.00', '10.00', '555', '2014-11-11 11:03:24');
INSERT INTO `tb_sales` VALUES ('206', '11', '123', '华为P6', 'HW', '1', '10.00', '10.00', '555', '2014-11-11 11:37:09');
INSERT INTO `tb_sales` VALUES ('207', '11', '123', '华为P6', 'HW', '1', '10.00', '10.00', '555', '2014-11-11 17:26:23');
INSERT INTO `tb_sales` VALUES ('208', '11', '123', '华为P6', 'HW', '1', '200.00', '200.00', 'boss', '2014-11-18 09:41:20');
INSERT INTO `tb_sales` VALUES ('209', '11', '123', '华为P6', 'HW', '1', '200.00', '200.00', '555', '2014-11-18 09:47:37');
INSERT INTO `tb_sales` VALUES ('210', '11', '123', '华为P6', 'HW', '3', '190.00', '570.00', '555', '2014-11-18 09:47:54');
INSERT INTO `tb_sales` VALUES ('211', '36', '6921734973023', '7302液体胶', '7302YTJ', '1', '5.00', '5.00', '555', '2014-11-18 16:47:40');
INSERT INTO `tb_sales` VALUES ('212', '36', '6921734973023', '7302液体胶', '7302YTJ', '1', '5.00', '5.00', '555', '2014-11-18 16:49:09');
INSERT INTO `tb_sales` VALUES ('213', '11', '123', '华为P6', 'HW', '3', '200.00', '600.00', '555', '2014-11-18 16:52:48');
INSERT INTO `tb_sales` VALUES ('214', '36', '6921734973023', '7302液体胶', '7302YTJ', '1', '5.00', '5.00', '555', '2014-11-18 16:58:03');
INSERT INTO `tb_sales` VALUES ('215', '11', '123', '华为P6', 'HW', '1', null, '0.00', null, '2014-11-18 17:44:34');
INSERT INTO `tb_sales` VALUES ('216', '11', '123', '华为P6', 'HW', '1', null, '0.00', null, '2014-11-18 17:45:32');
INSERT INTO `tb_sales` VALUES ('217', '11', '123', '华为P6', 'HW', '1', null, '0.00', null, '2014-11-18 17:55:22');
INSERT INTO `tb_sales` VALUES ('218', '11', '123', '华为P6', 'HW', '1', '200.00', '200.00', null, '2014-11-18 17:58:20');
INSERT INTO `tb_sales` VALUES ('219', '11', '123', '华为P6', 'HW', '1', '200.00', '200.00', null, '2014-11-19 09:34:56');
INSERT INTO `tb_sales` VALUES ('220', '11', '123', '华为P6', 'HW', '1', '200.00', '200.00', null, '2014-11-19 09:42:17');
INSERT INTO `tb_sales` VALUES ('221', '11', '123', '华为P6', 'HW', '1', '200.00', '200.00', null, '2014-11-19 09:56:47');
INSERT INTO `tb_sales` VALUES ('222', '11', '123', '华为P6', 'HW', '1', '200.00', '200.00', null, '2014-11-19 09:56:52');
INSERT INTO `tb_sales` VALUES ('223', '11', '123', '华为P6', 'HW', '1', '200.00', '200.00', null, '2014-11-19 09:57:07');
INSERT INTO `tb_sales` VALUES ('224', '11', '123', '华为P6', 'HW', '1', '200.00', '200.00', null, '2014-11-19 09:57:50');
INSERT INTO `tb_sales` VALUES ('225', '11', '123', '华为P6', 'HW', '1', '200.00', '200.00', null, '2014-11-19 10:08:36');
INSERT INTO `tb_sales` VALUES ('226', '11', '123', '华为P6', 'HW', '1', '200.00', '200.00', null, '2014-11-19 10:09:42');
INSERT INTO `tb_sales` VALUES ('227', '11', '123', '华为P6', 'HW', '1', '200.00', '200.00', null, '2014-11-19 10:09:56');
INSERT INTO `tb_sales` VALUES ('228', '11', '123', '华为P6', 'HW', '1', '200.00', '200.00', null, '2014-11-19 10:11:48');
INSERT INTO `tb_sales` VALUES ('229', '11', '123', '华为P6', 'HW', '1', '200.00', '200.00', null, '2014-11-19 10:12:32');
INSERT INTO `tb_sales` VALUES ('230', '11', '123', '华为P6', 'HW', '1', '200.00', '200.00', null, '2014-11-19 10:13:29');
INSERT INTO `tb_sales` VALUES ('231', '11', '123', '华为P6', 'HW', '1', '200.00', '200.00', null, '2014-11-19 10:17:48');
INSERT INTO `tb_sales` VALUES ('232', '11', '123', '华为P6', 'HW', '1', '200.00', '200.00', null, '2014-11-19 10:58:21');
INSERT INTO `tb_sales` VALUES ('233', '11', '123', '华为P6', 'HW', '1', '200.00', '200.00', null, '2014-11-19 11:02:25');
INSERT INTO `tb_sales` VALUES ('234', '11', '123', '华为P6', 'HW', '1', '200.00', '200.00', null, '2014-11-19 11:23:55');
INSERT INTO `tb_sales` VALUES ('235', '11', '123', '华为P6', 'HW', '1', '200.00', '200.00', null, '2014-11-19 11:27:58');
INSERT INTO `tb_sales` VALUES ('236', '11', '123', '华为P6', 'HW', '1', '200.00', '200.00', null, '2014-11-19 11:29:56');
INSERT INTO `tb_sales` VALUES ('237', '11', '123', '华为P6', 'HW', '1', '200.00', '200.00', null, '2014-11-19 11:33:51');
INSERT INTO `tb_sales` VALUES ('238', '11', '123', '华为P6', 'HW', '1', '200.00', '200.00', null, '2014-11-19 11:34:18');
INSERT INTO `tb_sales` VALUES ('239', '11', '123', '华为P6', 'HW', '1', '200.00', '200.00', null, '2014-11-19 11:34:29');
INSERT INTO `tb_sales` VALUES ('240', '11', '123', '华为P6', 'HW', '1', '200.00', '200.00', null, '2014-11-19 11:34:40');
INSERT INTO `tb_sales` VALUES ('241', '11', '123', '华为P6', 'HW', '1', '200.00', '200.00', null, '2014-11-19 11:35:02');
INSERT INTO `tb_sales` VALUES ('242', '11', '123', '华为P6', 'HW', '1', '200.00', '200.00', null, '2014-11-19 11:35:23');
INSERT INTO `tb_sales` VALUES ('243', '11', '123', '华为P6', 'HW', '1', '200.00', '200.00', null, '2014-11-19 11:38:09');
INSERT INTO `tb_sales` VALUES ('244', '11', '123', '华为P6', 'HW', '1', '200.00', '200.00', '周董', '2014-11-19 11:50:15');
INSERT INTO `tb_sales` VALUES ('245', '11', '123', '华为P6', 'HW', '1', '200.00', '200.00', '周董', '2014-11-19 11:54:13');
INSERT INTO `tb_sales` VALUES ('246', '11', '123', '华为P6', 'HW', '1', '200.00', '200.00', '周董', '2014-11-19 12:00:03');
INSERT INTO `tb_sales` VALUES ('247', '11', '123', '华为P6', 'HW', '1', '200.00', '200.00', '周董', '2014-11-19 12:02:23');
INSERT INTO `tb_sales` VALUES ('248', '11', '123', '华为P6', 'HW', '1', '200.00', '200.00', '周董', '2014-11-19 12:02:25');
INSERT INTO `tb_sales` VALUES ('249', '11', '123', '华为P6', 'HW', '1', '200.00', '200.00', '周董', '2014-11-19 12:02:31');
INSERT INTO `tb_sales` VALUES ('250', '11', '123', '华为P6', 'HW', '1', '200.00', '200.00', '周董', '2014-11-19 12:02:50');
INSERT INTO `tb_sales` VALUES ('251', '11', '123', '华为P6', 'HW', '1', '200.00', '200.00', 'boss', '2014-11-19 13:44:23');
INSERT INTO `tb_sales` VALUES ('252', '11', '123', '华为P6', 'HW', '1', '200.00', '200.00', '周董', '2014-11-19 13:46:11');
INSERT INTO `tb_sales` VALUES ('253', '11', '123', '华为P6', 'HW', '1', '200.00', '200.00', '周董', '2014-11-19 13:53:53');
INSERT INTO `tb_sales` VALUES ('254', '11', '123', '华为P6', 'HW', '1', null, '0.00', '周董', '2014-11-19 14:26:12');
INSERT INTO `tb_sales` VALUES ('255', '11', '123', '华为P6', 'HW', '1', '200.00', '200.00', '周董', '2014-11-19 14:30:35');
INSERT INTO `tb_sales` VALUES ('256', '11', '123', '华为P6', 'HW', '1', '200.00', '200.00', '周董', '2014-11-19 14:31:19');
INSERT INTO `tb_sales` VALUES ('257', '11', '123', '华为P6', 'HW', '1', '200.00', '200.00', '周董', '2014-11-19 14:31:24');
INSERT INTO `tb_sales` VALUES ('258', '11', '123', '华为P6', 'HW', '1', '200.00', '200.00', '周董', '2014-11-19 14:31:25');
INSERT INTO `tb_sales` VALUES ('259', '11', '123', '华为P6', 'HW', '1', '200.00', '200.00', '周董', '2014-11-19 14:32:13');
INSERT INTO `tb_sales` VALUES ('260', '11', '123', '华为P6', 'HW', '1', '200.00', '200.00', '周董', '2014-11-19 14:32:15');
INSERT INTO `tb_sales` VALUES ('261', '11', '123', '华为P6', 'HW', '1', '200.00', '200.00', '周董', '2014-11-19 14:32:24');
INSERT INTO `tb_sales` VALUES ('262', '11', '123', '华为P6', 'HW', '1', '200.00', '200.00', '周董', '2014-11-19 14:33:56');
INSERT INTO `tb_sales` VALUES ('263', '11', '123', '华为P6', 'HW', '1', '200.00', '200.00', '周董', '2014-11-19 14:33:58');
INSERT INTO `tb_sales` VALUES ('264', '11', '123', '华为P6', 'HW', '1', '200.00', '200.00', '周董', '2014-11-19 14:37:53');
INSERT INTO `tb_sales` VALUES ('265', '11', '123', '华为P6', 'HW', '1', '200.00', '200.00', '周董', '2014-11-19 14:37:55');
INSERT INTO `tb_sales` VALUES ('266', '11', '123', '华为P6', 'HW', '1', '200.00', '200.00', '周董', '2014-11-19 14:41:34');
INSERT INTO `tb_sales` VALUES ('267', '11', '123', '华为P6', 'HW', '1', '200.00', '200.00', 'Hong', '2014-11-19 14:44:13');
INSERT INTO `tb_sales` VALUES ('268', '11', '123', '华为P6', 'HW', '1', '200.00', '200.00', 'Hong', '2014-11-19 14:44:18');
INSERT INTO `tb_sales` VALUES ('269', '11', '123', '华为P6', 'HW', '1', '200.00', '200.00', 'Hong', '2014-11-19 14:44:22');
INSERT INTO `tb_sales` VALUES ('270', '11', '123', '华为P6', 'HW', '1', '200.00', '200.00', 'Hong', '2014-11-19 14:58:23');
INSERT INTO `tb_sales` VALUES ('271', '11', '123', '华为P6', 'HW', '1', '200.00', '200.00', 'Hong', '2014-11-19 16:43:54');
INSERT INTO `tb_sales` VALUES ('272', '11', '123', '华为P6', 'HW', '1', '200.00', '200.00', 'Hong', '2014-11-19 16:45:58');
INSERT INTO `tb_sales` VALUES ('273', '11', '123', '华为P6', 'HW', '1', '200.00', '200.00', 'Hong', '2014-11-19 16:51:28');
INSERT INTO `tb_sales` VALUES ('274', '11', '123', '华为P6', 'HW', '1', '200.00', '200.00', 'Hong', '2014-11-19 16:51:37');
INSERT INTO `tb_sales` VALUES ('275', '11', '123', '华为P6', 'HW', '1', '200.00', '200.00', '周董', '2014-11-20 15:40:02');
INSERT INTO `tb_sales` VALUES ('276', '11', '123', '华为P6', 'HW', '1', '200.00', '200.00', '周董', '2014-11-20 16:31:23');
INSERT INTO `tb_sales` VALUES ('277', '36', '6921734973023', '7302液体胶', '7302YTJ', '1', '5.00', '5.00', '周董', '2014-11-20 16:36:21');
INSERT INTO `tb_sales` VALUES ('278', '36', '6921734973023', '7302液体胶', '7302YTJ', '1', '5.00', '5.00', '周董', '2014-11-20 16:42:04');
INSERT INTO `tb_sales` VALUES ('279', '11', '123', '华为P6', 'HW', '1', '200.00', '200.00', '周董', '2014-11-20 16:58:32');
INSERT INTO `tb_sales` VALUES ('280', '11', '123', '华为P6', 'HW', null, '200.00', '0.00', '马boss', '2014-11-21 10:09:57');
INSERT INTO `tb_sales` VALUES ('281', '11', '123', '华为P6', 'HW', null, '200.00', '0.00', '马boss', '2014-11-21 10:10:30');
INSERT INTO `tb_sales` VALUES ('282', '11', '123', '华为P6', 'HW', null, '200.00', '0.00', '马boss', '2014-11-21 10:22:17');
INSERT INTO `tb_sales` VALUES ('283', '11', '123', '华为P6', 'HW', null, '200.00', '0.00', '马boss', '2014-11-21 10:26:17');
INSERT INTO `tb_sales` VALUES ('284', '11', '123', '华为P6', 'HW', null, '200.00', '0.00', '马boss', '2014-11-21 10:26:50');
INSERT INTO `tb_sales` VALUES ('285', '42', '123', '华为P6', 'HW', '1', '200.00', '200.00', '马boss', '2014-11-21 10:33:24');
INSERT INTO `tb_sales` VALUES ('286', '42', '123', '华为P6', 'HW', '1', '200.00', '200.00', '马boss', '2014-11-21 10:35:47');
INSERT INTO `tb_sales` VALUES ('287', '42', '123', '华为P6', 'HW', '1', '200.00', '200.00', '马boss', '2014-11-21 10:45:25');
INSERT INTO `tb_sales` VALUES ('288', '42', '123', '华为P6', 'HW', '1', '200.00', '200.00', '马boss', '2014-11-21 10:47:39');
INSERT INTO `tb_sales` VALUES ('289', '42', '123', '华为P6', 'HW', '1', '200.00', '200.00', '马boss', '2014-11-21 10:49:06');
INSERT INTO `tb_sales` VALUES ('290', '42', '123', '华为P6', 'HW', '1', '200.00', '200.00', '马boss', '2014-11-21 10:50:31');
INSERT INTO `tb_sales` VALUES ('291', '42', '123', '华为P6', 'HW', '1', '200.00', '200.00', '马boss', '2014-11-21 10:50:58');
INSERT INTO `tb_sales` VALUES ('292', '42', '123', '华为P6', 'HW', '1', '200.00', '200.00', '马boss', '2014-11-21 10:51:57');
INSERT INTO `tb_sales` VALUES ('293', '42', '123', '华为P6', 'HW', '1', '200.00', '200.00', '马boss', '2014-11-21 10:56:49');
INSERT INTO `tb_sales` VALUES ('294', '42', '123', '华为P6', 'HW', '1', '200.00', '200.00', '马boss', '2014-11-21 10:58:06');
INSERT INTO `tb_sales` VALUES ('295', '42', '123', '华为P6', 'HW', '1', '200.00', '200.00', '马boss', '2014-11-21 10:58:51');
INSERT INTO `tb_sales` VALUES ('296', '42', '123', '华为P6', 'HW', '1', '200.00', '200.00', '马boss', '2014-11-21 10:59:07');
INSERT INTO `tb_sales` VALUES ('297', '42', '123', '华为P6', 'HW', '1', '200.00', '200.00', '马boss', '2014-11-21 10:59:28');
INSERT INTO `tb_sales` VALUES ('298', '42', '123', '华为P6', 'HW', '1', '200.00', '200.00', '马boss', '2014-11-21 10:59:40');
INSERT INTO `tb_sales` VALUES ('299', '42', '123', '华为P6', 'HW', '1', '200.00', '200.00', '马boss', '2014-11-21 11:00:07');
INSERT INTO `tb_sales` VALUES ('300', '42', '123', '华为P6', 'HW', '1', '200.00', '200.00', '马boss', '2014-11-21 11:00:58');
INSERT INTO `tb_sales` VALUES ('301', '42', '123', '华为P6', 'HW', '1', '200.00', '200.00', '马boss', '2014-11-21 11:01:15');
INSERT INTO `tb_sales` VALUES ('302', '42', '123', '华为P6', 'HW', '1', '200.00', '200.00', '马boss', '2014-11-21 11:01:33');
INSERT INTO `tb_sales` VALUES ('303', '42', '123', '华为P6', 'HW', '1', '200.00', '200.00', '马boss', '2014-11-21 11:02:06');
INSERT INTO `tb_sales` VALUES ('304', '42', '123', '华为P6', 'HW', '1', '200.00', '200.00', '马boss', '2014-11-21 11:03:17');
INSERT INTO `tb_sales` VALUES ('305', '42', '123', '华为P6', 'HW', '1', '200.00', '200.00', '马boss', '2014-11-21 11:03:46');
INSERT INTO `tb_sales` VALUES ('306', '42', '123', '华为P6', 'HW', '1', '200.00', '200.00', '马boss', '2014-11-21 11:38:19');
INSERT INTO `tb_sales` VALUES ('307', '42', '123', '华为P6', 'HW', '1', '200.00', '200.00', '马boss', '2014-11-21 11:55:40');
INSERT INTO `tb_sales` VALUES ('308', '22', '123', '华为P6', 'HW', '1', '200.00', '200.00', '马boss', '2014-11-21 13:55:40');
INSERT INTO `tb_sales` VALUES ('309', '22', '123', '华为P6', 'HW', '1', '200.00', '200.00', '马boss', '2014-11-21 14:00:47');
INSERT INTO `tb_sales` VALUES ('310', '22', '123', '华为P6', 'HW', '1', '200.00', '200.00', '马boss', '2014-11-21 14:02:59');
INSERT INTO `tb_sales` VALUES ('311', '22', '123', '华为P6', 'HW', '1', '200.00', '200.00', '马boss', '2014-11-21 14:06:40');
INSERT INTO `tb_sales` VALUES ('312', '22', '123', '华为P6', 'HW', '1', '200.00', '200.00', '马boss', '2014-11-21 14:07:26');
INSERT INTO `tb_sales` VALUES ('313', '42', '123', '华为P6', 'HW', '13', '200.00', '2600.00', '马boss', '2014-11-21 14:07:41');
INSERT INTO `tb_sales` VALUES ('314', '42', '123', '华为P6', 'HW', '13', '200.00', '2600.00', '马boss', '2014-11-21 14:09:57');
INSERT INTO `tb_sales` VALUES ('315', '42', '123', '华为P6', 'HW', '13', '200.00', '2600.00', '马boss', '2014-11-21 14:10:35');
INSERT INTO `tb_sales` VALUES ('316', '42', '123', '华为P6', 'HW', '1', '200.00', '200.00', '马boss', '2014-11-21 14:11:24');
INSERT INTO `tb_sales` VALUES ('317', '42', '123', '华为P6', 'HW', '1', '200.00', '200.00', '马boss', '2014-11-21 14:11:41');
INSERT INTO `tb_sales` VALUES ('318', '42', '123', '华为P6', 'HW', '1', '200.00', '200.00', '马boss', '2014-11-21 14:12:15');
INSERT INTO `tb_sales` VALUES ('319', '42', '123', '华为P6', 'HW', '1', '200.00', '200.00', '马boss', '2014-11-21 14:13:41');
INSERT INTO `tb_sales` VALUES ('320', '42', '123', '华为P6', 'HW', '1', '200.00', '200.00', '马boss', '2014-11-21 14:14:13');
INSERT INTO `tb_sales` VALUES ('321', '42', '123', '华为P6', 'HW', '1', '200.00', '200.00', '马boss', '2014-11-21 14:15:28');
INSERT INTO `tb_sales` VALUES ('322', '42', '123', '华为P6', 'HW', '1', '200.00', '200.00', '马boss', '2014-11-21 14:16:07');
INSERT INTO `tb_sales` VALUES ('323', '42', '123', '华为P6', 'HW', '1', '200.00', '200.00', '马boss', '2014-11-21 14:16:42');
INSERT INTO `tb_sales` VALUES ('324', '42', '123', '华为P6', 'HW', '1', '200.00', '200.00', '马boss', '2014-11-21 14:17:08');
INSERT INTO `tb_sales` VALUES ('325', '42', '123', '华为P6', 'HW', '1', '200.00', '200.00', '马boss', '2014-11-21 14:17:16');
INSERT INTO `tb_sales` VALUES ('326', '42', '123', '华为P6', 'HW', '10', '200.00', '2000.00', '马boss', '2014-11-21 14:17:27');
INSERT INTO `tb_sales` VALUES ('327', '42', '123', '华为P6', 'HW', '1', '200.00', '200.00', '马boss', '2014-11-21 14:17:54');
INSERT INTO `tb_sales` VALUES ('328', '36', '6921734973023', '7302液体胶', '7302YTJ', '10', '5.00', '50.00', '马boss', '2014-11-21 14:38:40');
INSERT INTO `tb_sales` VALUES ('329', '36', '6921734973023', '7302液体胶', '7302YTJ', '1', '5.00', '5.00', '周董', '2014-11-24 11:41:29');
INSERT INTO `tb_sales` VALUES ('330', '36', '6921734973023', '7302液体胶', '7302YTJ', '1', '5.00', '5.00', '周董', '2014-11-24 11:41:36');
INSERT INTO `tb_sales` VALUES ('331', '36', '6921734973023', '7302液体胶', '7302YTJ', '10', '5.00', '50.00', '周董', '2014-11-24 11:41:58');
INSERT INTO `tb_sales` VALUES ('332', '42', '123', '华为P6', 'HW', '10', '200.00', '2000.00', '周董', '2014-11-25 14:49:48');
INSERT INTO `tb_sales` VALUES ('333', '42', '123', '华为P6', 'HW', '11', '200.00', '2200.00', '周董', '2014-11-25 14:50:01');
INSERT INTO `tb_sales` VALUES ('334', '42', '123', '华为P6', 'HW', '1', '200.00', '200.00', '周董', '2014-11-28 16:50:04');
INSERT INTO `tb_sales` VALUES ('335', '42', '123', '华为P6', 'HW', '1', '200.00', '200.00', '周董', '2014-11-28 16:50:10');
INSERT INTO `tb_sales` VALUES ('336', '42', '123', '华为P6', 'HW', '1', '200.00', '200.00', '周董', '2014-11-28 16:50:14');
INSERT INTO `tb_sales` VALUES ('337', '42', '123', '华为P6', 'HW', '1', '200.00', '200.00', '周董', '2014-12-04 15:14:22');

-- ----------------------------
-- Table structure for `tb_storage`
-- ----------------------------
DROP TABLE IF EXISTS `tb_storage`;
CREATE TABLE `tb_storage` (
  `id` int(10) NOT NULL AUTO_INCREMENT COMMENT '商品ID',
  `encode` varchar(255) NOT NULL COMMENT '商品编码',
  `barcode` varchar(255) NOT NULL COMMENT '商品独一无二的条形码',
  `letter` varchar(255) DEFAULT NULL COMMENT '首字母大写',
  `product` varchar(255) DEFAULT NULL COMMENT '商品名',
  `outtime` char(20) DEFAULT NULL COMMENT '出货时间',
  `outamount` int(11) DEFAULT NULL COMMENT '出货数量',
  `outprice` decimal(18,2) DEFAULT '0.00' COMMENT '出货单价',
  `outpresell` decimal(18,2) DEFAULT NULL COMMENT '销售价',
  `outsum` decimal(18,2) DEFAULT '0.00' COMMENT '出货金额=出货单价*出货量',
  `people` varchar(255) DEFAULT NULL COMMENT '经手人',
  PRIMARY KEY (`id`,`barcode`)
) ENGINE=InnoDB AUTO_INCREMENT=48 DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of tb_storage
-- ----------------------------
INSERT INTO `tb_storage` VALUES ('8', 'OUT1415264710', '6921294389463', 'YLNB', '玉林牛巴', '2014-11-06 17:05:10', '1091', '30.00', '200.00', '0.00', 'CYR');
INSERT INTO `tb_storage` VALUES ('11', 'OUT1413527745', '123', 'HW', '华为P6', '2014-11-10 10:13:12', '0', '2300.00', '200.00', '4600.00', 'XD');
INSERT INTO `tb_storage` VALUES ('12', 'OUT1413527831', '3695445855656', 'QZ', '裙子', '2014-12-10 10:16:10', '200', '10.00', '200.00', '10.00', 'Mrs Liu');
INSERT INTO `tb_storage` VALUES ('18', 'OUT1414051655', '123456', 'HW', '华为P6', '2014-10-15 10:19:13', '10', '300.00', '200.00', '3000.00', 'faf');
INSERT INTO `tb_storage` VALUES ('20', 'OUT1414051815', '2222', 'HW', '华为P6', '2014-10-23 16:10:15', '10', '600.00', '200.00', '6000.00', 'cls');
INSERT INTO `tb_storage` VALUES ('21', 'OUT1414051843', '123', 'HW', '华为P6', '2014-10-23 16:10:43', '0', '600.00', '200.00', '6000.00', 'cls');
INSERT INTO `tb_storage` VALUES ('22', 'OUT1414119429', '123', 'HW', '华为P6', '2014-10-24 10:57:09', '0', '2324.00', '200.00', '23240.00', 'xc');
INSERT INTO `tb_storage` VALUES ('25', 'OUT1415264905', '9996999969966', 'LSWX', '六神蚊香', '2014-11-06 17:08:25', '10', '10.00', '200.00', '100.00', '20');
INSERT INTO `tb_storage` VALUES ('26', 'OUT1415324455', '9699559999999', 'XEQXC', '小儿七星茶', '2014-11-07 09:40:55', '10', '6.00', '200.00', '60.00', '雅琳');
INSERT INTO `tb_storage` VALUES ('27', 'OUT1415684903', '123', '', '华为P6', '2014-11-11 13:48:23', '0', '3000.00', '200.00', '30000.00', 'CLC');
INSERT INTO `tb_storage` VALUES ('28', 'OUT1415684931', '123', '', '华为P6', '2014-11-11 13:48:51', '0', '2300.00', '200.00', '6900.00', 'CYR');
INSERT INTO `tb_storage` VALUES ('30', 'OUT1415696357', '9996999969966', 'LSWX', '六神蚊香', '2014-11-11 16:59:17', '10', '12.00', '200.00', '120.00', '黑马神');
INSERT INTO `tb_storage` VALUES ('31', 'OUT1415696941', '3695445855656', 'QZ', '裙子', '2014-11-11 17:09:01', '11', '11.00', '200.00', '121.00', '1111');
INSERT INTO `tb_storage` VALUES ('32', 'OUT1415697160', '3695445855656', 'QZ', '裙子', '2014-11-11 17:12:40', '11', '11.00', '200.00', '121.00', '1111');
INSERT INTO `tb_storage` VALUES ('33', 'OUT1415697265', '3695445855656', 'QZ', '裙子', '2014-11-11 17:14:25', '111', '1111.00', '200.00', '123321.00', '111111');
INSERT INTO `tb_storage` VALUES ('34', 'OUT1415697516', '3695445855656', 'QZ', '裙子', '2014-11-11 17:18:36', '111', '111.00', '112.00', '12321.00', '1111');
INSERT INTO `tb_storage` VALUES ('35', 'OUT1416273906', '123', '', '华为P6', '2014-11-18 09:25:06', '0', '2600.00', '3100.00', '26000.00', 'CLC');
INSERT INTO `tb_storage` VALUES ('36', 'OUT1416300202', '6921734973023', '', '7302液体胶', '2014-11-18 16:43:22', '73', '3.00', '5.00', '300.00', 'CC');
INSERT INTO `tb_storage` VALUES ('37', 'OUT1416300351', '6901285991219', 'YBYYCJS', '怡宝引用纯净水', '2014-11-18 16:45:51', '20', '3.00', null, '60.00', 'LLK');
INSERT INTO `tb_storage` VALUES ('38', 'OUT1416468711', '6901285991219', '', '怡宝引用纯净水', '2014-11-20 15:31:51', '555', '19.00', null, '220.00', 'ss');
INSERT INTO `tb_storage` VALUES ('39', 'OUT1416469864', '123', '', '华为P6', '2014-11-20 15:51:04', '0', '300.00', '500.00', '90000.00', null);
INSERT INTO `tb_storage` VALUES ('40', 'OUT1416469944', '123', '', '华为P6', '2014-11-20 15:52:24', '0', '3.00', '5.00', '6.00', '马boss');
INSERT INTO `tb_storage` VALUES ('41', 'OUT1416470955', '62179330088', 'BBDB', 'BB大宝', '2014-11-20 16:09:15', '50', '30.00', '60.00', '1500.00', '马boss');
INSERT INTO `tb_storage` VALUES ('42', 'OUT1416472030', '123', 'HW', '华为P6', '2014-11-20 16:27:10', '98929', '3.00', '3.00', '9.00', '周董');
INSERT INTO `tb_storage` VALUES ('43', 'OUT1416541354', '62179330088', 'BBDB', 'BB大宝', '2014-11-21 11:42:34', '33', '33.00', '60.00', '1089.00', '马boss');
INSERT INTO `tb_storage` VALUES ('44', 'OUT1416541425', '62179330088', 'BBDB', 'BB大宝', '2014-11-21 11:43:45', '33', '33.00', '33.00', '1089.00', '马boss');
INSERT INTO `tb_storage` VALUES ('45', 'OUT1416550375', '123', 'HW', '华为P6', '2014-11-21 14:12:55', '10', '10.00', '14.00', '100.00', '马boss');
INSERT INTO `tb_storage` VALUES ('46', 'OUT1416551643', '6921734973023', '7302YTJ', '7302液体胶', '2014-11-21 14:34:03', '16', '16.00', '19.00', '256.00', '马boss');
INSERT INTO `tb_storage` VALUES ('47', 'OUT1416800541', '6921734973023', '7302YTJ', '7302液体胶', '2014-11-24 11:42:21', '1000', '1.30', '3.00', '1300.00', '周董');
